/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhawkgir <dhawkgir@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/06 12:51:50 by dhawkgir          #+#    #+#             */
/*   Updated: 2021/10/29 15:53:41 by dhawkgir         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Функция atoi конвертирует строку, на которую указывает параметр str,
в величину типа int. Строка должна содержать корректную запись целого числа.
В противном случае возвращается 0. Число может завершаться любым символом,
который не может входить в состав строкового представления целого числа.
Сюда относятся пробелы, знаки пунктуации и другие знаки, не являющиеся цифрами.
*/
#include "libft.h"

int	ft_atoi(const char *str)
{
	size_t	i;
	int		sign;
	size_t	number;

	number = 0;
	sign = 1;
	i = 0;
	if (!*str)
		return (0);
	while (*(str + i) == ' ' || (*(str + i) >= '\t' && *(str + i) <= '\r'))
		i++;
	if (*(str + i) == '-')
		sign = -1;
	if (*(str + i) == '+' || *(str + i) == '-')
		i++;
	while (*(str + i) >= '0' && *(str + i) <= '9')
	{
		number = number * 10 + *(str + i) - '0';
		i++;
	}
	if (number > 2147483648)
		return (-1 + (sign < 0 && number > 2147483648));
	return (sign * number);
}
