/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhawkgir <dhawkgir@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/13 14:41:23 by dhawkgir          #+#    #+#             */
/*   Updated: 2021/10/29 15:54:09 by dhawkgir         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Функция ft_striteri применяет функцию f к каждому символу строки s,
переданной в качестве аргумента,
и передав ее индекс в качестве первого аргумента.
Каждый символ передается по адресу f для изменения, если это необходимо.
*/
#include "libft.h"

void	ft_striteri(char *s, void (*f)(unsigned int, char *))
{
	unsigned int	index;

	index = 0;
	if (!s || !f)
		return ;
	while (*(s + index) && f)
	{
		f(index, s + index);
		index++;
	}
}
